// первое задание
// let num = prompt('Пиши любое число, и я дам результат четное или нечетное')

// if (num% 2 === 0) {
//     alert(num + " четное")
// }else{
//     alert(num + " нечетное")
// }

//второе задание
// let name = prompt('Ведите ваше имя! Пропускаются те у каво имя начинается с буквы А/а').trim().toLowerCase()

// if (name[0] === 'а' || name[0] === 'a') {
//     alert("Ваше имя начинается с буквы а, добро пожаловать")
// }else if (name[0] != ""){
//     alert("Ваше имя не начинается с буквы а")
// }else{
//     alert('вы не вели имя!!!')
// }

//третье задание

// let namE = prompt("Введите имя:")
// let old = +prompt("Введите свой возраст!")

// if (namE.length% 2 === 0 && old >= 18) {
//     alert('Имя содержит четное количество букв.')
// }else if (namE){
//     alert("Имя содержит нечетное количество букв.")
// }else if(old >= 18){
//     alert("Вы такой взрослый")
// }else{
//     alert("Не растрайвойся приходи когда будет 18+")
// }